// f:\code\part_time_job\tiktok-education\pages\industryProspects\industryProspects.js
Page({
  data: {
    // 行业发展前景
    developmentProspects: [
      {
        img: "t5",
        title: "行业发展前景一",
        content:
          "行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案",
      },
      {
        img: "t6",
        title: "行业发展前景二",
        content:
          "行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案",
      },
      {
        img: "t5",
        title: "行业发展前景三",
        content:
          "行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案",
      },
      {
        img: "t6",
        title: "行业发展前景四",
        content:
          "行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案行业发展前景文案",
      },
    ],
    // 公司对外合作动态/新闻
    news: [
      {
        img: "t4",
        title: "国家扶持政策",
        date: "2023-7-14",
        content:
          "文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案",
      },
      {
        img: "t4",
        title: "国家扶持政策......",
        date: "2023-7-14",
        content:
          "文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案",
      },
      {
        img: "t4",
        title: "国家扶持政策",
        date: "2023-7-14",
        content:
          "文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案",
      },
      {
        img: "t4",
        title: "国家扶持政策",
        date: "2023-7-14",
        content:
          "文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案",
      },
    ],
  },
  onLoad: function (options) {},
});
