// components/test.js
Component({
    /**
     * 组件的初始数据
     */
    data: {
        // 活动列表
        activities: [
            {img: "t1", name: "学员日常活动"},
            {img: "t2", name: "学员日常活动"},
            {img: "t3", name: "学员日常活动"},
            {img: "t1", name: "学员日常活动"},
            {img: "t2", name: "学员日常活动"},
            {img: "t3", name: "学员日常活动"},
        ],
        // 公司对外合作动态/新闻
        news: [
            {img: 't4', title: '新闻标题一', date: '2023-7-14', content: '文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案'},
            {img: 't4', title: '新闻标题二', date: '2023-7-14', content: '文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案'},
            {img: 't4', title: '新闻标题三', date: '2023-7-14', content: '文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案'},
            {img: 't4', title: '新闻标题四', date: '2023-7-14', content: '文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案文章描述文案'}
        ]
    },

    /**
     * 组件的方法列表
     */
    methods: {}
});
